procedure-esercizi/procedure.tex
% Created 2022-06-04 Sat 16:54
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{epigraph}
\date{\today}
\title{Gli stessi quattro esercizi}
\hypersetup{
 pdfauthor={},
 pdftitle={Gli stessi quattro esercizi},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1 (Org mode 9.5.2)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\epigraph{Come potete vedere la procedura è del tutto sistematica}{Battistelli G.}

\section{Quantizzatore}
\label{sec:orgbab6409}
\subsection{Solita traccia}
\label{sec:org6abe209}
Abbiamo un segnale \(x(t)\) fatto da \(x_1 (t)\), \(x_2 (t)\), e a volte
anche \(x_3 (t)\), \(x_{boh} (t)\) è fatto da \(s_{boh} (t)\) (segnale
utile) e \(r_{boh} (t)\) (rumore). Hai le forme dei segnali \(s_{boh}
(t)\) e hai le SNR \(\frac{P_{s_{boh}}}{P_{r_{boh}}}\).\par

Vogliamo sapere
\begin{itemize}
\item Il guadagno necessario per farlo passare per un
quantizzatore di dinamica \((-1, 1)\)
\item Il rapporto segnale-rumore all'ingresso del quantizzaotore
\item Il rapporto segnale-rumore all'uscita del quantizzatore,
oppure il numero di bit necessari per avere un rapporto
segnale-rumore maggiore di \(SNR_{in} - 0.5dB\)
\end{itemize}

\subsection{Soliti passi}
\label{sec:org32da708}
I sottosegnali \(s_{boh} (t)\) hanno 2 possibili forme
\begin{itemize}
\item Un seno/coseno
\item Un segnale gaussiamo
\end{itemize}
Vediamo come gestirli per i passi dell'esercizio descritti sopra

\subsubsection{Guadagno necessario per far passare}
\label{sec:org921a614}
Dobbiamo sapere quali sono i valori massimi/ minimi assumibili dal
segnale in modo da far rientrare questi nella dinamica del
quantizzatore (con dinamica di un quantizzatore si intende l'insieme
dei valori con cui questo può lavorare senza fare errori indecenti).

Un coseno, mettiamo nella forma \(A \cos (2\pi ft)\) ha dinamica \((-A,
A)\) (con dinamica di un segnale si intende l'insieme dei valori che
possono essere assunti da questo).

Un segnale gaussiano viene campionato solo nelle fasce da \(-4\sigma\) e
\(4\sigma\), ai fini di questi esercizii avrà quidni dinamica
\((-4\sigma, 4\sigma)\)

Questo segnale con la somma di tutti avrà minimo possibile pari alla
somma di tutti i minimi delle sue parti, e massimo assoluto pari alla
somma di tutti i massimi delle sue parti

Prendiamo per esempio il segnale
\[ segnale \]

le componenti avranno dinamiche
\[ dinamiche \]

sommando i minimi e i massimi di queste avremo la dinamica del segnale
pari a
\[ dinamica \]

per scalarla a \((-1, 1)\) sarà quindi necessario\ldots{}

\subsubsection{SNR all'ingresso del quantizzatore}
\label{sec:orgd955887}
la SNR (signal to noise ratio) è definita come il rapporto tra le
potenze del segnale e del rumore: dato il solito cazzo di
\[x_{boh} = s_{boh} + r_{boh}\]
la \(SNR_{boh}\) sarà definita come
\[SNR_{boh} = \frac{P_{s_{boh}}}{P_{r_{boh}}}\]

La SNR all'ingresso del quantizzatore sarà

Come abbiamo detto prima i due input sono che ci interessano sono
coseno e gaussiana nel primo caso la potenza del segnale è \(frac{1}{2}
\times\) l'ampiezza, per ungenerico \(A \cos(2\pi f t + \phi)\) la
potenza sarà quindi
\[P = \frac{A^2}{2}\] 
Per il segnale gaussiano la potenza sarà pari alla varianza \(\sigma
^2\), questa viene data con il segnale.


\section{Zeta}
\label{sec:orgfe3ad1a}
\subsection{Le stesse 3 sequenze}
\label{sec:orgb89bcfa}

\section{LTI}
\label{sec:org78f31e6}
\subsection{Dalla Z alle differenze finite}
\label{sec:org59f15ea}
\subsection{Dalle differenze finite alla Z}
\label{sec:org0975d25}

\section{DFT}
\label{sec:org43f1a82}


\section{Argenti patterns}
\label{sec:org08e854b}
\subsection{Sinusoidi}
\label{sec:orge09878a}
\subsection{Teoremi miracolati e come abusarli}
\label{sec:org8c2a1c0}
\end{document}